v2206/Projects/tests/myPimpleTest/0.orig/Sh2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Sh2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dimensions      [1 -3 0 0 0 0 0];
dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1; // 2.5055e-7;

boundaryField
{
    up
    {
        type            cyclic;
    }

    down
    {
        type            cyclic;
    }

    right
    {
        type            cyclic;
    }

    left
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
